Revit 2027 API
PlumbingUtils.HasOpenConnector Method
 Checks if there is open piping connector for the given element - object of pipe curve, pipe fitting or pipe accessory.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool HasOpenConnector(
	Document document,
	ElementId elemId
)
Public Shared Function HasOpenConnector (
	document As Document,
	elemId As ElementId
) As Boolean
public:
static bool HasOpenConnector(
	Document^ document,
	ElementId^ elemId
)
static member HasOpenConnector :
        document : Document *
        elemId : ElementId -> bool
Parameters
document Document
 The document.
elemId ElementId
 Element id to check.
Return Value
Boolean
 True if given element has open piping connector, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PlumbingUtils Class
Autodesk.Revit.DB.Plumbing Namespace